recept/src/Documents/ПервоначальныеОстатки/ПервоначальныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПервоначальныеОстатки</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Наменование</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/InformationRegisters/ЦеныМатериалов/ЦеныМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМатериалов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьМатериалов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Documents/ПервоначальныеОстатки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЦеныМатериалов.Записывать = Истина;   
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;


	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		// регистр ЦеныМатериалов
		Движение = Движения.ЦеныМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Наменование;
		Движение.Цена = ТекСтрокаНоменклатура.Цена;

		// регистр ОстаткиМатериалов
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаНоменклатура.Наменование;
		Движение.Остаток = ТекСтрокаНоменклатура.Количество;    
		
		// регистр СтоимостьМатериалов 
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаНоменклатура.Наменование;
		Движение.Стоимость = ТекСтрокаНоменклатура.Сумма; 
		
	КонецЦикла;

КонецПроцедуры
